_posts/programming/2022-04-02-cppcoreguidelines-i27.html
---
layout: post
title: CppCoreGuidelines I.27 对于稳定库 ABI，考虑用 Pimpl 封装
categories: [programming]
tags: [CppCoreGuidelines]
---
<p>
<a href="http://kimi.im/tags.html#CppCoreGuidelines-ref">C++ 核心指南目录</a>
</p>

<p>
I.27: For stable library ABI, consider the Pimpl idiom
</p>

<p>
<b>理由</b>
</p>

<p>
因为私有成员变量构成类的内部布局，私有成员函数则参与函数重载解析，修改了类的底层实现，就要求重新编译使用该类的所有文件。
</p>

<p>
通过让一个非多态的接口保管一个指向实现的指针（ Pimpl ），就可以分离代码实现的变动。付出的代价就是无法直接访问底层的实现。
</p>


<p>
<b>例子</b>
</p>

<p>
接口 (widget.h)
</p>

<div class="org-src-container">
<pre class="src src- src-C++"><span style="color: #7F0055; font-weight: bold;">class</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">widget</span> <span style="color: #707183;">{</span>
    <span style="color: #7F0055; font-weight: bold;">class</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">impl</span>;
    <span style="color: #000000; font-style: italic; text-decoration: underline;">std</span>::<span style="color: #000000; font-style: italic; text-decoration: underline;">unique_ptr</span><span style="color: #7388d6; font-weight: bold;">&lt;</span><span style="color: #000000; font-style: italic; text-decoration: underline;">impl</span><span style="color: #7388d6; font-weight: bold;">&gt;</span> <span style="color: #000000; font-style: italic;">pimpl</span>;
<span style="color: #7F0055; font-weight: bold;">public</span>:
    <span style="color: #7F0055; font-weight: bold;">void</span> <span style="color: #0000ff; font-weight: bold; font-style: italic;">draw</span><span style="color: #7388d6;">()</span>; <span style="color: #3F7F5F;">// public API that will be forwarded to the implementation</span>
    <span style="color: #0000ff; font-weight: bold;">widget</span><span style="color: #7388d6;">(</span><span style="color: #7F0055; font-weight: bold;">int</span><span style="color: #7388d6;">)</span>; <span style="color: #3F7F5F;">// defined in the implementation file</span>
    <span style="color: #7F0055; font-weight: bold;">~</span>widget<span style="color: #7388d6;">()</span>;   <span style="color: #3F7F5F;">// defined in the implementation file,</span>
                 <span style="color: #3F7F5F;">// where impl is a complete type</span>
    <span style="color: #0000ff; font-weight: bold;">widget</span><span style="color: #7388d6;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">widget</span><span style="color: #7F0055; font-weight: bold;">&amp;&amp;</span><span style="color: #7388d6;">)</span> <span style="color: #7F0055; font-weight: bold;">noexcept</span>; <span style="color: #3F7F5F;">// defined in the implementation file</span>
    <span style="color: #0000ff; font-weight: bold;">widget</span><span style="color: #7388d6;">(</span><span style="color: #7F0055; font-weight: bold;">const</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">widget</span><span style="color: #7F0055; font-weight: bold;">&amp;</span><span style="color: #7388d6;">)</span> <span style="color: #7F0055; font-weight: bold;">=</span> <span style="color: #7F0055; font-weight: bold;">delete</span>;
    <span style="color: #000000; font-style: italic; text-decoration: underline;">widget</span><span style="color: #7F0055; font-weight: bold;">&amp;</span> operator<span style="color: #7F0055; font-weight: bold;">=</span><span style="color: #7388d6;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">widget</span><span style="color: #7F0055; font-weight: bold;">&amp;&amp;</span><span style="color: #7388d6;">)</span> <span style="color: #7F0055; font-weight: bold;">noexcept</span>; <span style="color: #3F7F5F;">// defined in the implementation file</span>
    <span style="color: #000000; font-style: italic; text-decoration: underline;">widget</span><span style="color: #7F0055; font-weight: bold;">&amp;</span> operator<span style="color: #7F0055; font-weight: bold;">=</span><span style="color: #7388d6;">(</span><span style="color: #7F0055; font-weight: bold;">const</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">widget</span><span style="color: #7F0055; font-weight: bold;">&amp;</span><span style="color: #7388d6;">)</span> <span style="color: #7F0055; font-weight: bold;">=</span> <span style="color: #7F0055; font-weight: bold;">delete</span>;
<span style="color: #707183;">}</span>;
</pre>
</div>

<p>
widget的底层实现 (widget.cpp)
</p>

<div class="org-src-container">
<pre class="src src- src-C++"><span style="color: #7F0055; font-weight: bold;">class</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">widget</span>::<span style="color: #000000; font-style: italic; text-decoration: underline;">impl</span> <span style="color: #707183;">{</span>
    <span style="color: #7F0055; font-weight: bold;">int</span> <span style="color: #000000; font-style: italic;">n</span>; <span style="color: #3F7F5F;">// private data</span>
<span style="color: #7F0055; font-weight: bold;">public</span>:
    <span style="color: #7F0055; font-weight: bold;">void</span> <span style="color: #0000ff; font-weight: bold; font-style: italic;">draw</span><span style="color: #7388d6;">(</span><span style="color: #7F0055; font-weight: bold;">const</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">widget</span><span style="color: #7F0055; font-weight: bold;">&amp;</span> <span style="color: #000000;">w</span><span style="color: #7388d6;">)</span> <span style="color: #7388d6;">{</span> <span style="color: #3F7F5F;">/* ... */</span> <span style="color: #7388d6;">}</span>
    <span style="color: #0000ff; font-weight: bold;">impl</span><span style="color: #7388d6;">(</span><span style="color: #7F0055; font-weight: bold;">int</span> <span style="color: #000000;">n</span><span style="color: #7388d6;">)</span> : <span style="color: #110099; font-style: italic;">n</span><span style="color: #7388d6;">(</span>n<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">{}</span>
<span style="color: #707183;">}</span>;
<span style="color: #7F0055; font-weight: bold;">void</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">widget</span>::<span style="color: #0000ff; font-weight: bold;">draw</span><span style="color: #707183;">()</span> <span style="color: #707183;">{</span> pimpl<span style="color: #7F0055; font-weight: bold;">-&gt;</span><span style="color: #3a5fcd; font-weight: bold; font-style: italic;">draw</span><span style="color: #7388d6;">(</span><span style="color: #7F0055; font-weight: bold;">*</span><span style="color: #7F0055; font-weight: bold;">this</span><span style="color: #7388d6;">)</span>; <span style="color: #707183;">}</span>
<span style="color: #000000; font-style: italic; text-decoration: underline;">widget</span>::<span style="color: #0000ff; font-weight: bold;">widget</span><span style="color: #707183;">(</span><span style="color: #7F0055; font-weight: bold;">int</span> <span style="color: #000000;">n</span><span style="color: #707183;">)</span> : <span style="color: #110099; font-style: italic;">pimpl</span><span style="color: #707183;">{</span><span style="color: #000000; font-style: italic; text-decoration: underline;">std</span>::<span style="color: #3a5fcd; font-weight: bold;">make_unique</span><span style="color: #7388d6; font-weight: bold;">&lt;</span><span style="color: #3a5fcd; font-weight: bold; font-style: italic; text-decoration: underline;">impl</span><span style="color: #7388d6; font-weight: bold;">&gt;</span><span style="color: #7388d6;">(</span>n<span style="color: #7388d6;">)</span><span style="color: #707183;">}</span> <span style="color: #707183;">{}</span>
<span style="color: #000000; font-style: italic; text-decoration: underline;">widget</span>::<span style="color: #0000ff; font-weight: bold;">widget</span><span style="color: #707183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">widget</span><span style="color: #7F0055; font-weight: bold;">&amp;&amp;</span><span style="color: #707183;">)</span> <span style="color: #7F0055; font-weight: bold;">noexcept</span> <span style="color: #7F0055; font-weight: bold;">=</span> <span style="color: #7F0055; font-weight: bold;">default</span>;
<span style="color: #000000; font-style: italic; text-decoration: underline;">widget</span>::<span style="color: #0000ff; font-weight: bold;">~</span><span style="color: #0000ff; font-weight: bold;">widget</span><span style="color: #707183;">()</span> <span style="color: #7F0055; font-weight: bold;">=</span> <span style="color: #7F0055; font-weight: bold;">default</span>;
<span style="color: #000000; font-style: italic; text-decoration: underline;">widget</span><span style="color: #7F0055; font-weight: bold;">&amp;</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">widget</span>::<span style="color: #0000ff; font-weight: bold;">operator</span><span style="color: #0000ff; font-weight: bold;">=</span><span style="color: #707183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">widget</span><span style="color: #7F0055; font-weight: bold;">&amp;&amp;</span><span style="color: #707183;">)</span> <span style="color: #7F0055; font-weight: bold;">noexcept</span> <span style="color: #7F0055; font-weight: bold;">=</span> <span style="color: #000000;">default</span>;
</pre>
</div>


<p>
<b>注意</b>
</p>

<p>
更多实现细节 <a href="https://herbsutter.com/gotw/_100/">GOTW #100</a> <a href="https://en.cppreference.com/w/cpp/language/pimpl">cppreference</a>
</p>
